import { useState } from "react";
import { Button } from "../../components/ui/Button/Button";
import {
    Card,
    CardAnons,
    CardImage,
    CardProfile,
} from "../../components/ui/Card/Card";
import { Quiz, type QuizAnswerData } from "../../components/ui/Quiz/Quiz";
import type { LocationScreenProps } from "./types";
import styles from "./AcademyLocation.module.css";
import { ChevronRight } from "lucide-react";

import schoolboyThink from "../../assets/images/persons/schoolboy/think.png";
import schoolboyKlass from "../../assets/images/persons/schoolboy/klass.png";

import startCardImage from "../../assets/images/city/locations/academy/start-card-image.png";
import startCardAvatar from "../../assets/images/city/locations/academy/start-card-avatar.png";

const answers: QuizAnswerData[] = [
    {
        id: "1",
        text: "Центральный банк РФ сообщает тебе, что твоя карта заблокирована",
        icon: (
            <svg
                width="32"
                height="32"
                viewBox="0 0 32 32"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
            >
                <g clip-path="url(#clip0_3004_9854)">
                    <path
                        d="M9.35944 16.0003C8.41147 15.9527 7.46369 16.098 6.5736 16.4277C5.6835 16.7573 4.86965 17.2644 4.18141 17.918C3.49317 18.5716 2.94488 19.3583 2.5698 20.2302C2.19473 21.1021 2.00068 22.0412 1.99945 22.9903C1.99945 26.8503 5.13945 29.9903 8.99944 29.9903C12.6594 29.9903 15.6394 27.1903 15.9594 23.6303L17.6214 25.5503C17.069 27.4123 15.929 29.0456 14.3718 30.2063C12.8146 31.3671 10.9237 31.9929 8.98145 31.9903C4.00145 31.9903 -0.0185547 27.9703 -0.0185547 22.9903C-0.0185547 18.4703 3.32145 14.7103 7.68145 14.0903L9.34144 16.0043L9.35944 16.0003ZM0.345445 0.244332C0.545737 0.0707356 0.806754 -0.0162434 1.07114 0.00250756C1.33553 0.0212585 1.58166 0.144205 1.75545 0.344332L23.9554 25.9443H23.9854L25.5814 27.7883H25.5534L27.7534 30.3283C27.8395 30.4276 27.9051 30.5429 27.9466 30.6675C27.988 30.7921 28.0046 30.9237 27.9952 31.0548C27.9858 31.1858 27.9507 31.3137 27.8919 31.4311C27.8331 31.5486 27.7517 31.6533 27.6524 31.7393C27.5532 31.8253 27.4379 31.891 27.3133 31.9324C27.1886 31.9739 27.0571 31.9904 26.926 31.9811C26.795 31.9717 26.6671 31.9366 26.5497 31.8778C26.4322 31.819 26.3275 31.7376 26.2414 31.6383L0.241445 1.63833C0.0678489 1.43804 -0.01913 1.17702 -0.000379104 0.912635C0.0183718 0.648247 0.141319 0.402119 0.341445 0.228332L0.345445 0.244332Z"
                        fill="white"
                    />
                    <path
                        fill-rule="evenodd"
                        clip-rule="evenodd"
                        d="M23 0C28 0 32 2 32 4V23C32 24.396 31.126 25.58 29.7 26.44L28.362 24.896L28.426 24.866C29.71 24.176 30.008 23.474 30.008 23.002V20.242C29.804 20.382 29.5887 20.5133 29.362 20.636C28.37 21.176 27.122 21.582 25.682 21.808L24.09 19.97C25.946 19.85 27.41 19.43 28.41 18.882C29.64 18.21 30.014 17.478 30.014 17.008V14.248C29.81 14.388 29.5947 14.5193 29.368 14.642C27.81 15.492 25.628 16.016 23.008 16.016C22.1187 16.016 21.2853 15.958 20.508 15.842L18.188 13.162C19.362 13.668 20.988 14.018 23.008 14.018C25.388 14.018 27.208 13.542 28.408 12.892C29.638 12.22 30.012 11.488 30.012 11.018V8.26C29.808 8.40133 29.5927 8.53267 29.366 8.654C27.808 9.504 25.626 10.028 23.006 10.028C20.386 10.028 18.206 9.504 16.646 8.654C16.4246 8.53293 16.209 8.40145 16 8.26V10.66L14 8.36V4.04C14 2.04 18 0.04 23 0.04V0ZM23 2C20.74 2 18 2.814 17.46 3.066C17.242 3.166 16.966 3.348 16.712 3.532C16.4857 3.70311 16.3031 3.92529 16.179 4.18041C16.0549 4.43552 15.9929 4.71635 15.998 5C15.998 5.47 16.372 6.2 17.602 6.872C18.794 7.522 20.622 7.998 23.002 7.998C25.382 7.998 27.202 7.522 28.402 6.872C29.632 6.2 30.006 5.468 30.006 4.998V4.986C30.0124 4.7053 29.9524 4.42706 29.8307 4.17401C29.709 3.92096 29.5292 3.70028 29.306 3.53C29.0664 3.35121 28.8106 3.1952 28.542 3.064C27.218 2.452 25.262 1.998 23.002 1.998L23 2Z"
                        fill="white"
                    />
                </g>
                <defs>
                    <clipPath id="clip0_3004_9854">
                        <rect width="32" height="32" fill="white" />
                    </clipPath>
                </defs>
            </svg>
        ),
        iconBackground: "#3990F9",
    },
    {
        id: "2",
        text: "Сотрудник банка просит тебя назвать ПИН-код",
        icon: (
            <svg
                width="32"
                height="32"
                viewBox="0 0 32 32"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
            >
                <path
                    d="M11 14.333C11 13.0069 11.5268 11.7352 12.4645 10.7975C13.4021 9.85979 14.6739 9.33301 16 9.33301C17.3261 9.33301 18.5979 9.85979 19.5355 10.7975C20.4732 11.7352 21 13.0069 21 14.333C21 17.0947 22.02 19.4697 22.6667 20.9997"
                    stroke="white"
                    stroke-width="2.5"
                    stroke-linecap="round"
                    stroke-linejoin="round"
                />
                <path
                    d="M16.0003 14.3337V17.2503C15.9987 19.1003 17.102 20.927 17.667 22.667M11.0003 19.7503C11.1137 20.717 11.597 21.727 11.8337 22.667M2.66699 9.33366V6.00033C2.66699 5.11627 3.01818 4.26842 3.6433 3.6433C4.26842 3.01818 5.11627 2.66699 6.00033 2.66699H9.33366M2.66699 22.667V26.0003C2.66699 26.8844 3.01818 27.7322 3.6433 28.3573C4.26842 28.9825 5.11627 29.3337 6.00033 29.3337H9.33366M22.667 2.66699H26.0003C26.8844 2.66699 27.7322 3.01818 28.3573 3.6433C28.9825 4.26842 29.3337 5.11627 29.3337 6.00033V9.33366M22.667 29.3337H26.0003C26.8844 29.3337 27.7322 28.9825 28.3573 28.3573C28.9825 27.7322 29.3337 26.8844 29.3337 26.0003V22.667"
                    stroke="white"
                    stroke-width="2.5"
                    stroke-linecap="round"
                    stroke-linejoin="round"
                />
            </svg>
        ),
        iconBackground: "#82c7e1",
    },
    {
        id: "3",
        text: "При обращении тобой в колл-центр банка, сотрудник просит назвать кодовое слово или паспортные данные",
        correct: true,
        icon: (
            <svg
                width="32"
                height="32"
                viewBox="0 0 32 32"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
            >
                <path
                    d="M20 25.3333C20 22.3878 16.4183 20 12 20C7.58172 20 4 22.3878 4 25.3333M22.4375 6.89551C22.9327 7.39075 23.3256 7.9787 23.5936 8.62577C23.8616 9.27284 23.9997 9.96625 23.9997 10.6666C23.9997 11.367 23.8618 12.0606 23.5937 12.7076C23.3257 13.3547 22.9327 13.9427 22.4375 14.4379M25.3333 4C26.2088 4.87548 26.9033 5.91482 27.3771 7.05869C27.8509 8.20256 28.0946 9.42845 28.0946 10.6666C28.0946 11.9047 27.8508 13.1308 27.377 14.2746C26.9031 15.4185 26.2088 16.458 25.3333 17.3334M12 16C9.05448 16 6.66667 13.6122 6.66667 10.6667C6.66667 7.72115 9.05448 5.33333 12 5.33333C14.9455 5.33333 17.3333 7.72115 17.3333 10.6667C17.3333 13.6122 14.9455 16 12 16Z"
                    stroke="white"
                    stroke-width="2"
                    stroke-linecap="round"
                    stroke-linejoin="round"
                />
            </svg>
        ),
        iconBackground: "#F46248",
    },
];

export function AcademyScreen({
    person,
    isCompleted,
    setReply,
    setBackgroundVariant,
    completeLocation,
    closeLocation,
}: LocationScreenProps) {
    const [step, setStep] = useState<"intro" | "question">(
        isCompleted ? "question" : "intro",
    );

    const handleStart = () => {
        setStep("question");
        setReply({
            image: person.image,
            text: "Я приготовил для тебя небольшой квиз!\n**Выбери правильный вариант ответа**",
        });
    };

    const handleCorrectAnswer = () => {
        completeLocation();
    };

    if (step === "question") {
        return (
            <div className={`${styles.quiz}`}>
                <Card className={`${styles.quizCard}`}>
                    <Quiz
                        question={{
                            text: "Что не является финансовым мошенничеством?",
                            icon: (
                                <svg
                                    width="44"
                                    height="44"
                                    viewBox="0 0 44 44"
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg"
                                >
                                    <path
                                        d="M22.0003 40.3337C32.1255 40.3337 40.3337 32.1255 40.3337 22.0003C40.3337 11.8751 32.1255 3.66699 22.0003 3.66699C11.8751 3.66699 3.66699 11.8751 3.66699 22.0003C3.66699 32.1255 11.8751 40.3337 22.0003 40.3337Z"
                                        stroke="white"
                                        strokeWidth="2"
                                    />
                                    <path
                                        d="M18.334 15.5547C19.2507 13.7397 20.1673 12.834 22.0007 12.834C24.285 12.834 25.6673 14.6472 25.6673 16.4603C25.6673 18.2735 24.7507 19.1792 22.0007 20.9942V23.834M22.0007 30.2507V31.1673"
                                        stroke="white"
                                        strokeWidth="2"
                                        strokeLinecap="round"
                                    />
                                </svg>
                            ),
                            iconBackground: "#F46248",
                        }}
                        answers={answers}
                        wrongReplies={[
                            {
                                image: schoolboyThink,
                                text: "Ответ неверный, но после наших обучающих материалов ты будешь решать такое на раз",
                            },
                            {
                                image: person.image,
                                text: "Остался последний вариант. Скорее всего, он и есть верный!",
                            },
                        ]}
                        successReply={{
                            image: schoolboyKlass,
                            text: "**В точку!**\nЯ бы так же ответил. Готов двигаться дальше?",
                        }}
                        setReply={setReply}
                        setBackgroundVariant={setBackgroundVariant}
                        onCorrect={handleCorrectAnswer}
                        onContinue={closeLocation}
                        continueText="Продолжить"
                    />
                </Card>
            </div>
        );
    }

    return (
        <div className={`${styles.intro}`}>
            <Card className={`${styles.introCard}`}>
                <CardAnons
                    icon={
                        <svg
                            width="44"
                            height="44"
                            viewBox="0 0 44 44"
                            fill="none"
                            xmlns="http://www.w3.org/2000/svg"
                        >
                            <path
                                d="M22.0913 28.3249H23.0913C23.0913 27.7726 22.6436 27.3249 22.0913 27.3249V28.3249ZM22.0913 28.5082L22.0911 29.5082C22.3563 29.5083 22.6107 29.403 22.7983 29.2154C22.9859 29.0279 23.0913 28.7735 23.0913 28.5082H22.0913ZM21.9087 28.5082H20.9087C20.9087 29.0604 21.3563 29.5081 21.9084 29.5082L21.9087 28.5082ZM21.9087 28.3249V27.3249C21.3564 27.3249 20.9087 27.7726 20.9087 28.3249H21.9087ZM23 15.4916C23 14.9393 22.5523 14.4916 22 14.4916C21.4477 14.4916 21 14.9393 21 15.4916H22H23ZM21 22.8249C21 23.3772 21.4477 23.8249 22 23.8249C22.5523 23.8249 23 23.3772 23 22.8249H22H21ZM22 38.5V37.5C13.4396 37.5 6.5 30.5604 6.5 22H5.5H4.5C4.5 31.665 12.335 39.5 22 39.5V38.5ZM5.5 22H6.5C6.5 13.4396 13.4396 6.5 22 6.5V5.5V4.5C12.335 4.5 4.5 12.335 4.5 22H5.5ZM22 5.5V6.5C30.5604 6.5 37.5 13.4396 37.5 22H38.5H39.5C39.5 12.335 31.665 4.5 22 4.5V5.5ZM38.5 22H37.5C37.5 30.5604 30.5604 37.5 22 37.5V38.5V39.5C31.665 39.5 39.5 31.665 39.5 22H38.5ZM22.0913 28.3249H21.0913V28.5082H22.0913H23.0913V28.3249H22.0913ZM22.0913 28.5082L22.0916 27.5082L21.9089 27.5082L21.9087 28.5082L21.9084 29.5082L22.0911 29.5082L22.0913 28.5082ZM21.9087 28.5082H22.9087V28.3249H21.9087H20.9087V28.5082H21.9087ZM21.9087 28.3249V29.3249H22.0913V28.3249V27.3249H21.9087V28.3249ZM22 15.4916H21V22.8249H22H23V15.4916H22Z"
                                fill="white"
                            />
                        </svg>
                    }
                    iconBackground="#3990F9"
                >
                    После регистрации на платформе тебя ждут не скучные лекции,{" "}
                    <strong>а живые форматы:</strong>
                </CardAnons>
                <CardImage src={startCardImage} alt={"Изображение"} />
                <CardProfile
                    avatar={startCardAvatar}
                    description="Я сам прошел несколько — и даже получил сертификаты. И в финансах разберёшься, и к олимпиаде подготовишься, ещё и баллы получишь"
                />
                <Button size="s" fullWidth onClick={handleStart}>
                    Продолжить
                    <ChevronRight />
                </Button>
            </Card>
        </div>
    );
}
