import { useState } from "react";
import { Button } from "../../components/ui/Button/Button";
import {
    Card,
    CardAnons,
    CardImage,
    CardProfile,
} from "../../components/ui/Card/Card";
import { Quiz, type QuizAnswerData } from "../../components/ui/Quiz/Quiz";
import type { LocationScreenProps } from "./types";
import styles from "./AcademyLocation.module.css";
import { ChevronRight } from "lucide-react";

import startCardImage from "../../assets/images/city/locations/academy/start-card-image.png";
import startCardStudentAvatar from "../../assets/images/city/locations/academy/start-card-student-avatar.png";

import studentNodTop from "../../assets/images/persons/student/nod-top.png";
import studentThink from "../../assets/images/persons/student/think.png";
import studentKlass from "../../assets/images/persons/student/klass.png";

const answers: QuizAnswerData[] = [
    {
        id: "1",
        text: "Спрошу у неё куда выслать деньги",
        icon: (
            <svg
                width="32"
                height="32"
                viewBox="0 0 32 32"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
            >
                <path
                    d="M16.0003 29.3337C23.3641 29.3337 29.3337 23.3641 29.3337 16.0003C29.3337 8.63653 23.3641 2.66699 16.0003 2.66699C8.63653 2.66699 2.66699 8.63653 2.66699 16.0003C2.66699 23.3641 8.63653 29.3337 16.0003 29.3337Z"
                    stroke="white"
                    stroke-width="2"
                />
                <path
                    d="M13.334 11.3127C14.0007 9.99265 14.6673 9.33398 16.0007 9.33398C17.662 9.33398 18.6673 10.6527 18.6673 11.9713C18.6673 13.29 18.0007 13.9487 16.0007 15.2687V17.334M16.0007 22.0007V22.6673"
                    stroke="white"
                    stroke-width="2"
                    stroke-linecap="round"
                />
            </svg>
        ),
        iconBackground: "#3990F9",
    },
    {
        id: "2",
        text: "Уточню у подруги, зачем ей нужна эта сумма",
        icon: (
            <svg
                width="34"
                height="34"
                viewBox="0 0 34 34"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
            >
                <path
                    d="M8.49967 15.5837H11.0043C12.1557 15.5835 13.2951 15.8173 14.3533 16.2707L21.0471 19.1395C21.5271 19.346 21.9362 19.6886 22.224 20.1248C22.5117 20.5611 22.6655 21.072 22.6663 21.5946C22.6663 22.5777 21.8688 23.3753 20.8856 23.3753H19.9747C18.9464 23.3756 17.9275 23.1794 16.9728 22.7973L14.8747 21.9587M2.83301 25.5003V17.0003C2.83301 16.3416 2.83301 16.0129 2.90526 15.7423C3.00186 15.3823 3.19147 15.054 3.45505 14.7905C3.71863 14.5269 4.0469 14.3373 4.40692 14.2407C4.68034 14.167 5.00901 14.167 5.66634 14.167C6.32367 14.167 6.65376 14.167 6.92434 14.2392C7.28436 14.3358 7.61264 14.5255 7.87622 14.789C8.13979 15.0526 8.3294 15.3809 8.42601 15.7409C8.49967 16.0129 8.49967 16.343 8.49967 17.0003V25.5003C8.49967 26.1591 8.49967 26.4892 8.42742 26.7583C8.33082 27.1183 8.14121 27.4466 7.87763 27.7102C7.61405 27.9738 7.28578 28.1634 6.92576 28.26C6.65234 28.3337 6.32367 28.3337 5.66634 28.3337C5.00901 28.3337 4.67892 28.3337 4.40834 28.2614C4.04832 28.1648 3.72005 27.9752 3.45647 27.7116C3.19289 27.448 3.00328 27.1198 2.90667 26.7597C2.83301 26.4877 2.83301 26.1577 2.83301 25.5003Z"
                    stroke="white"
                    stroke-width="2.25"
                    stroke-linecap="round"
                    stroke-linejoin="round"
                />
                <path
                    d="M19.8333 23.375H29.1479C29.6346 23.3754 30.1048 23.5515 30.4719 23.8711C30.839 24.1907 31.0782 24.6321 31.1457 25.1141C31.2131 25.5961 31.1041 26.0862 30.8388 26.4942C30.5735 26.9022 30.1697 27.2007 29.7018 27.3346L22.3068 29.4483C20.9441 29.838 19.5013 29.8507 18.1319 29.4851L8.5 26.9167"
                    stroke="white"
                    stroke-width="2.25"
                    stroke-linecap="round"
                    stroke-linejoin="round"
                />
                <path
                    d="M25.4997 15.5833C28.6293 15.5833 31.1663 13.0463 31.1663 9.91667C31.1663 6.78705 28.6293 4.25 25.4997 4.25C22.3701 4.25 19.833 6.78705 19.833 9.91667C19.833 13.0463 22.3701 15.5833 25.4997 15.5833Z"
                    stroke="white"
                    stroke-width="2.25"
                    stroke-linecap="round"
                    stroke-linejoin="round"
                />
            </svg>
        ),
        iconBackground: "#82c7e1",
    },
    {
        id: "3",
        text: "Позвоню подруге по по номеру телефона, чтобы убедиться, что её аккаунт не взломали мошенники",
        correct: true,
        icon: (
            <svg
                width="32"
                height="32"
                viewBox="0 0 32 32"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
            >
                <path
                    d="M10.4388 21.5614C7.57137 18.6883 5.36618 15.2236 3.97749 11.4094C3.21349 9.32403 3.91349 7.03336 5.48416 5.4627L6.45616 4.49203C6.71748 4.23019 7.02787 4.02245 7.36957 3.88071C7.71127 3.73897 8.07756 3.66602 8.44749 3.66602C8.81742 3.66602 9.18372 3.73897 9.52542 3.88071C9.86712 4.02245 10.1775 4.23019 10.4388 4.49203L12.7148 6.76803C12.9767 7.02935 13.1844 7.33974 13.3261 7.68144C13.4679 8.02314 13.5408 8.38943 13.5408 8.75936C13.5408 9.12929 13.4679 9.49559 13.3261 9.83729C13.1844 10.179 12.9767 10.4894 12.7148 10.7507L12.1548 11.3107C11.9307 11.5348 11.7529 11.8009 11.6315 12.0937C11.5102 12.3865 11.4478 12.7004 11.4478 13.0174C11.4478 13.3343 11.5102 13.6482 11.6315 13.941C11.7529 14.2339 11.9307 14.4999 12.1548 14.724L17.2748 19.8454C17.4989 20.0695 17.765 20.2473 18.0578 20.3686C18.3507 20.49 18.6645 20.5524 18.9815 20.5524C19.2985 20.5524 19.6123 20.49 19.9052 20.3686C20.198 20.2473 20.4641 20.0695 20.6882 19.8454L21.2495 19.2854C21.5108 19.0235 21.8212 18.8158 22.1629 18.674C22.5046 18.5323 22.8709 18.4593 23.2408 18.4593C23.6108 18.4593 23.9771 18.5323 24.3188 18.674C24.6605 18.8158 24.9708 19.0235 25.2322 19.2854L27.5082 21.5614C27.77 21.8227 27.9777 22.1331 28.1195 22.4748C28.2612 22.8165 28.3342 23.1828 28.3342 23.5527C28.3342 23.9226 28.2612 24.2889 28.1195 24.6306C27.9777 24.9723 27.77 25.2827 27.5082 25.544L26.5375 26.5147C24.9668 28.0867 22.6762 28.7867 20.5908 28.0227C16.7766 26.634 13.3119 24.4288 10.4388 21.5614Z"
                    stroke="white"
                    stroke-width="2"
                    stroke-linejoin="round"
                />
            </svg>
        ),
        iconBackground: "#F46248",
    },
];

export function StudentAcademyScreen({
    person,
    isCompleted,
    setReply,
    setBackgroundVariant,
    completeLocation,
    closeLocation,
}: LocationScreenProps) {
    const [step, setStep] = useState<"intro" | "question">(
        isCompleted ? "question" : "intro",
    );

    const handleStart = () => {
        setStep("question");
        setReply({
            image: studentNodTop,
            text: "Возможно, ты давно в теме, но мне хочется узнать, применяешь ли ты знания в реальной жизни.\n**Выбери правильный вариант действий в этой ситуации**",
        });
    };

    const handleCorrectAnswer = () => {
        completeLocation();
    };

    if (step === "question") {
        return (
            <div className={`${styles.quiz}`}>
                <Card
                    className={`${styles.quizCard} ${styles.studentQuizCard}`}
                >
                    <Quiz
                        question={{
                            text: "Тебе в мессенджер пришло сообщение от подруги с просьбой одолжить большую сумму денег. Твои действия?",
                            icon: (
                                <svg
                                    width="44"
                                    height="44"
                                    viewBox="0 0 44 44"
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg"
                                >
                                    <path
                                        d="M22 38.5C25.2634 38.5 28.4535 37.5323 31.1669 35.7193C33.8803 33.9062 35.9952 31.3293 37.244 28.3143C38.4929 25.2993 38.8196 21.9817 38.183 18.781C37.5463 15.5803 35.9748 12.6403 33.6673 10.3327C31.3597 8.02518 28.4197 6.45371 25.219 5.81705C22.0183 5.18039 18.7007 5.50715 15.6857 6.75599C12.6707 8.00484 10.0938 10.1197 8.28075 12.8331C6.46771 15.5465 5.5 18.7366 5.5 22C5.5 24.64 6.11967 27.1333 7.22333 29.3462C8.05383 31.0163 6.89883 33.2695 6.45883 34.914C6.36135 35.2777 6.36134 35.6607 6.45878 36.0244C6.55623 36.3881 6.74771 36.7198 7.01397 36.986C7.28023 37.2523 7.61189 37.4438 7.97561 37.5412C8.33933 37.6387 8.72229 37.6386 9.086 37.5412C10.7305 37.1012 12.9837 35.9462 14.6538 36.7785C16.9367 37.912 19.4512 38.5013 22 38.5Z"
                                        stroke="white"
                                        stroke-width="2"
                                        stroke-linecap="round"
                                        stroke-linejoin="round"
                                    />
                                </svg>
                            ),
                            iconBackground: "#F46248",
                        }}
                        answers={answers}
                        wrongReplies={[
                            {
                                image: studentThink,
                                text: "**Опасно.**\nА вдруг аккаунт подруги взломали мошенники? Давай ещё раз?",
                            },
                            {
                                image: person.image,
                                text: "Давай ещё раз",
                            },
                        ]}
                        successReply={{
                            image: studentKlass,
                            text: "**В точку.**\nПомочь подруге — хорошее дело, главное, удостовериться, что это её просьба, а не уловка мошенников",
                        }}
                        setReply={setReply}
                        setBackgroundVariant={setBackgroundVariant}
                        broadcastPersonId={person.id}
                        broadcastQuizId="quiz2"
                        onCorrect={handleCorrectAnswer}
                        onContinue={closeLocation}
                        continueText="Продолжить"
                    />
                </Card>
            </div>
        );
    }

    return (
        <div className={`${styles.intro}`}>
            <Card className={`${styles.introCard}`}>
                <CardAnons
                    icon={
                        <svg
                            width="44"
                            height="44"
                            viewBox="0 0 44 44"
                            fill="none"
                            xmlns="http://www.w3.org/2000/svg"
                        >
                            <path
                                d="M22.0913 28.3249H23.0913C23.0913 27.7726 22.6436 27.3249 22.0913 27.3249V28.3249ZM22.0913 28.5082L22.0911 29.5082C22.3563 29.5083 22.6107 29.403 22.7983 29.2154C22.9859 29.0279 23.0913 28.7735 23.0913 28.5082H22.0913ZM21.9087 28.5082H20.9087C20.9087 29.0604 21.3563 29.5081 21.9084 29.5082L21.9087 28.5082ZM21.9087 28.3249V27.3249C21.3564 27.3249 20.9087 27.7726 20.9087 28.3249H21.9087ZM23 15.4916C23 14.9393 22.5523 14.4916 22 14.4916C21.4477 14.4916 21 14.9393 21 15.4916H22H23ZM21 22.8249C21 23.3772 21.4477 23.8249 22 23.8249C22.5523 23.8249 23 23.3772 23 22.8249H22H21ZM22 38.5V37.5C13.4396 37.5 6.5 30.5604 6.5 22H5.5H4.5C4.5 31.665 12.335 39.5 22 39.5V38.5ZM5.5 22H6.5C6.5 13.4396 13.4396 6.5 22 6.5V5.5V4.5C12.335 4.5 4.5 12.335 4.5 22H5.5ZM22 5.5V6.5C30.5604 6.5 37.5 13.4396 37.5 22H38.5H39.5C39.5 12.335 31.665 4.5 22 4.5V5.5ZM38.5 22H37.5C37.5 30.5604 30.5604 37.5 22 37.5V38.5V39.5C31.665 39.5 39.5 31.665 39.5 22H38.5ZM22.0913 28.3249H21.0913V28.5082H22.0913H23.0913V28.3249H22.0913ZM22.0913 28.5082L22.0916 27.5082L21.9089 27.5082L21.9087 28.5082L21.9084 29.5082L22.0911 29.5082L22.0913 28.5082ZM21.9087 28.5082H22.9087V28.3249H21.9087H20.9087V28.5082H21.9087ZM21.9087 28.3249V29.3249H22.0913V28.3249V27.3249H21.9087V28.3249ZM22 15.4916H21V22.8249H22H23V15.4916H22Z"
                                fill="white"
                            />
                        </svg>
                    }
                    iconBackground="#3990F9"
                >
                    После регистрации на платформе тебя ждут не скучные лекции,{" "}
                    <strong>а живые форматы:</strong>
                </CardAnons>
                <CardImage src={startCardImage} alt={"Изображение"} />
                <CardProfile
                    avatar={startCardStudentAvatar}
                    description="Я сама прошла несколько — и даже получила сертификаты. И в финансах разберёшься, и к стажировке подготовишься, ещё и навыки прокачаешь"
                />
                <Button size="s" fullWidth onClick={handleStart}>
                    Продолжить
                    <ChevronRight />
                </Button>
            </Card>
        </div>
    );
}
